---
kind: method
id: M:Autodesk.Revit.DB.ExternalFileReference.GetLinkedFileStatus
source: html/cd21f80a-f8be-535a-0793-7c113f27c487.htm
---
# Autodesk.Revit.DB.ExternalFileReference.GetLinkedFileStatus Method

Returns a LinkedFileStatus.Enum corresponding to the
 load status of the referenced file.

## Syntax (C#)
```csharp
public LinkedFileStatus GetLinkedFileStatus()
```

## Remarks
Options are Invalid,
 Loaded, Unloaded, NotFound, or Imported.